app/Models/ModelHibahDana.php

    public function allData()
    {
        return $this->db->table('tb_hibah_dana')
            ->select('tb_hibah_dana.*, tb_user.*')
            ->join('tb_user', 'tb_user.id_user = tb_hibah_dana.created_by OR tb_user.id_user = tb_hibah_dana.edited_by', 'left')
            ->orderBy('tb_hibah_dana.created_at', 'ASC')
            ->get()->getResultArray();
---
SELECT `tb_hibah_dana`.*, `tb_user`.*
FROM `tb_hibah_dana`
LEFT JOIN `tb_user` ON `tb_user`.`id_user` = `tb_hibah_dana`.`created_by` OR `tb_user`.`id_user` = `tb_hibah_dana`.`edited_by`
ORDER BY `tb_hibah_dana`.`created_at` ASC