app/Models/ModelBerita.php

    public function allData()
    {
        return $this->db->table('tb_berita')
            ->select('tb_berita.*, tb_user.*')
            ->join('tb_user', 'tb_user.id_user = tb_berita.id_user OR tb_user.id_user = tb_berita.edited_by', 'left')
            ->orderBy('tb_berita.created_at', 'ASC')
            ->get()->getResultArray();
---
SELECT `tb_berita`.*, `tb_user`.*
FROM `tb_berita`
LEFT JOIN `tb_user` ON `tb_user`.`id_user` = `tb_berita`.`id_user` OR `tb_user`.`id_user` = `tb_berita`.`edited_by`
ORDER BY `tb_berita`.`created_at` ASC

    public function beritaPenelitian()
    {
        return $this->db->table('tb_berita')
            ->select('tb_berita.*, tb_user.*')
            ->join('tb_user', 'tb_user.id_user = tb_berita.id_user OR tb_user.id_user = tb_berita.edited_by', 'left')
            ->where('tb_berita.kategori', 1)
            ->orderBy('tb_berita.created_at', 'ASC')
            ->get()->getResultArray();
---
SELECT `tb_berita`.*, `tb_user`.*
FROM `tb_berita`
LEFT JOIN `tb_user` ON `tb_user`.`id_user` = `tb_berita`.`id_user` OR `tb_user`.`id_user` = `tb_berita`.`edited_by`
WHERE `tb_berita`.`kategori` = 1
ORDER BY `tb_berita`.`created_at` ASC

    public function beritaKegiatan()
    {
        return $this->db->table('tb_berita')
            ->select('tb_berita.*, tb_user.*')
            ->join('tb_user', 'tb_user.id_user = tb_berita.id_user OR tb_user.id_user = tb_berita.edited_by', 'left')
            ->where('tb_berita.kategori', 2)
            ->orderBy('tb_berita.created_at', 'ASC')
            ->get()->getResultArray();
---
SELECT `tb_berita`.*, `tb_user`.*
FROM `tb_berita`
LEFT JOIN `tb_user` ON `tb_user`.`id_user` = `tb_berita`.`id_user` OR `tb_user`.`id_user` = `tb_berita`.`edited_by`
WHERE `tb_berita`.`kategori` = 2
ORDER BY `tb_berita`.`created_at` ASC

    public function detailData($id_berita)
    {
        return $this->db->table('tb_berita')
            ->select('tb_berita.*, tb_user.*')
            ->join('tb_user', 'tb_user.id_user = tb_berita.id_user OR tb_user.id_user = tb_berita.edited_by', 'left')
            ->where('tb_berita.id_berita', $id_berita)
            ->get()->getRowArray();
---
SELECT `tb_berita`.*, `tb_user`.*
FROM `tb_berita`
LEFT JOIN `tb_user` ON `tb_user`.`id_user` = `tb_berita`.`id_user` OR `tb_user`.`id_user` = `tb_berita`.`edited_by`
WHERE `tb_berita`.`id_berita` = '1'