app/Models/ModelAgenda.php

    public function allData()
    {
        return $this->db->table('tb_agenda')
            ->select('tb_agenda.*, tb_user.*')
            ->join('tb_user', 'tb_user.id_user = tb_agenda.id_user OR tb_user.id_user = tb_agenda.edited_by', 'left')
            ->orderBy('tb_agenda.created_at', 'ASC')
            ->get()->getResultArray();
---
SELECT `tb_agenda`.*, `tb_user`.*
FROM `tb_agenda`
LEFT JOIN `tb_user` ON `tb_user`.`id_user` = `tb_agenda`.`id_user` OR `tb_user`.`id_user` = `tb_agenda`.`edited_by`
ORDER BY `tb_agenda`.`created_at` ASC