app/Models/ModelUnduh.php

    public function allData()
    {
        return $this->db->table('tb_unduh')
            ->select('tb_unduh.*, tb_user.*')
            ->join('tb_user', 'tb_user.id_user = tb_unduh.id_user OR tb_user.id_user = tb_unduh.edited_by', 'left')
            ->orderBy('tb_unduh.created_at', 'ASC')
            ->get()->getResultArray();
---
SELECT `tb_unduh`.*, `tb_user`.*
FROM `tb_unduh`
LEFT JOIN `tb_user` ON `tb_user`.`id_user` = `tb_unduh`.`id_user` OR `tb_user`.`id_user` = `tb_unduh`.`edited_by`
ORDER BY `tb_unduh`.`created_at` ASC