app/Models/ModelTentangKami.php

    public function allData()
    {
        return $this->db->table('tb_tentang_kami')
            ->join('tb_user', 'tb_user.id_user = tb_tentang_kami.id_user AND tb_user.id_user = tb_tentang_kami.edited_by', 'left')
            ->orderBy('tb_tentang_kami.created_at', 'ASC')
            ->get()->getResultArray();
---
SELECT *
FROM `tb_tentang_kami`
LEFT JOIN `tb_user` ON `tb_user`.`id_user` = `tb_tentang_kami`.`id_user` AND `tb_user`.`id_user` = `tb_tentang_kami`.`edited_by`
ORDER BY `tb_tentang_kami`.`created_at` ASC