app/Models/ModelPengguna.php

SELECT *
FROM `tb_user`
ORDER BY `nm_user` ASC
---
    public function allData()
    {
        return $this->db->table('tb_user')
            ->orderBy('nm_user', 'ASC')
            ->get()->getResultArray();