app/Models/ModelLogin.php

    public function login_user($email)
    {
        return $this->db->table('tb_user')->where([
            'email' => $email
        ])->get()->getRowArray();
---
SELECT *
FROM `tb_user`
WHERE `email` = 'admin@penelitian.gunadarma.ac.id'