app/Models/ModelHibahPenelitian.php

    public function allData()
    {
        return $this->db->table('tb_hibah_penelitian')
            ->select('tb_hibah_penelitian.*, tb_user.*')
            ->join('tb_user', 'tb_user.id_user = tb_hibah_penelitian.created_by OR tb_user.id_user = tb_hibah_penelitian.edited_by', 'left')
            ->orderBy('tb_hibah_penelitian.created_at', 'ASC')
            ->get()->getResultArray();
---
SELECT `tb_hibah_penelitian`.*, `tb_user`.*
FROM `tb_hibah_penelitian`
LEFT JOIN `tb_user` ON `tb_user`.`id_user` = `tb_hibah_penelitian`.`created_by` OR `tb_user`.`id_user` = `tb_hibah_penelitian`.`edited_by`
ORDER BY `tb_hibah_penelitian`.`created_at` ASC